#version: 0.2 - Trained by `huggingface/tokenizers`
# #
" ##
a r
e t
g et
t ar
Ġ X
"## #
tar get
1 2
1 8
2 8
3 6
7 5
4 8
5 5
6 4
7 1
9 6
2 2
4 2
4 5
5 4
7 0
9 7
9 8
1 9
3 3
3 8
4 7
6 1
6 2
6 3
7 6
7 8
8 2
9 2
9 5
1 3
2 1
2 4
3 5
4 3
5 6
5 8
6 7
8 3
9 9
4 1
5 3
7 2
8 0
9 0
9 3
1 1
1 7
2 6
2 9
3 1
3 4
4 0
4 4
4 9
5 7
7 3
7 9
8 1
8 5
9 4
2 5
3 2
5 0
6 0
6 5
6 9
7 4
7 7
8 6
1 5
1 6
2 0
2 7
3 7
4 6
5 2
6 8
8 4
8 9
3 0
6 6
8 8
9 1
1 0
2 3
5 1
5 9
1 4
8 7
3 9
