{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "!": 0,
      "\"": 1,
      "#": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      ";": 26,
      "<": 27,
      "=": 28,
      ">": 29,
      "?": 30,
      "@": 31,
      "A": 32,
      "B": 33,
      "C": 34,
      "D": 35,
      "E": 36,
      "F": 37,
      "G": 38,
      "H": 39,
      "I": 40,
      "J": 41,
      "K": 42,
      "L": 43,
      "M": 44,
      "N": 45,
      "O": 46,
      "P": 47,
      "Q": 48,
      "R": 49,
      "S": 50,
      "T": 51,
      "U": 52,
      "V": 53,
      "W": 54,
      "X": 55,
      "Y": 56,
      "Z": 57,
      "[": 58,
      "\\": 59,
      "]": 60,
      "^": 61,
      "_": 62,
      "`": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "|": 91,
      "}": 92,
      "~": 93,
      "¡": 94,
      "¢": 95,
      "£": 96,
      "¤": 97,
      "¥": 98,
      "¦": 99,
      "§": 100,
      "¨": 101,
      "©": 102,
      "ª": 103,
      "«": 104,
      "¬": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "±": 109,
      "²": 110,
      "³": 111,
      "´": 112,
      "µ": 113,
      "¶": 114,
      "·": 115,
      "¸": 116,
      "¹": 117,
      "º": 118,
      "»": 119,
      "¼": 120,
      "½": 121,
      "¾": 122,
      "¿": 123,
      "À": 124,
      "Á": 125,
      "Â": 126,
      "Ã": 127,
      "Ä": 128,
      "Å": 129,
      "Æ": 130,
      "Ç": 131,
      "È": 132,
      "É": 133,
      "Ê": 134,
      "Ë": 135,
      "Ì": 136,
      "Í": 137,
      "Î": 138,
      "Ï": 139,
      "Ð": 140,
      "Ñ": 141,
      "Ò": 142,
      "Ó": 143,
      "Ô": 144,
      "Õ": 145,
      "Ö": 146,
      "×": 147,
      "Ø": 148,
      "Ù": 149,
      "Ú": 150,
      "Û": 151,
      "Ü": 152,
      "Ý": 153,
      "Þ": 154,
      "ß": 155,
      "à": 156,
      "á": 157,
      "â": 158,
      "ã": 159,
      "ä": 160,
      "å": 161,
      "æ": 162,
      "ç": 163,
      "è": 164,
      "é": 165,
      "ê": 166,
      "ë": 167,
      "ì": 168,
      "í": 169,
      "î": 170,
      "ï": 171,
      "ð": 172,
      "ñ": 173,
      "ò": 174,
      "ó": 175,
      "ô": 176,
      "õ": 177,
      "ö": 178,
      "÷": 179,
      "ø": 180,
      "ù": 181,
      "ú": 182,
      "û": 183,
      "ü": 184,
      "ý": 185,
      "þ": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "Ă": 190,
      "ă": 191,
      "Ą": 192,
      "ą": 193,
      "Ć": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ē": 207,
      "Ĕ": 208,
      "ĕ": 209,
      "Ė": 210,
      "ė": 211,
      "Ę": 212,
      "ę": 213,
      "Ě": 214,
      "ě": 215,
      "Ĝ": 216,
      "ĝ": 217,
      "Ğ": 218,
      "ğ": 219,
      "Ġ": 220,
      "ġ": 221,
      "Ģ": 222,
      "ģ": 223,
      "Ĥ": 224,
      "ĥ": 225,
      "Ħ": 226,
      "ħ": 227,
      "Ĩ": 228,
      "ĩ": 229,
      "Ī": 230,
      "ī": 231,
      "Ĭ": 232,
      "ĭ": 233,
      "Į": 234,
      "į": 235,
      "İ": 236,
      "ı": 237,
      "Ĳ": 238,
      "ĳ": 239,
      "Ĵ": 240,
      "ĵ": 241,
      "Ķ": 242,
      "ķ": 243,
      "ĸ": 244,
      "Ĺ": 245,
      "ĺ": 246,
      "Ļ": 247,
      "ļ": 248,
      "Ľ": 249,
      "ľ": 250,
      "Ŀ": 251,
      "ŀ": 252,
      "Ł": 253,
      "ł": 254,
      "Ń": 255,
      "##": 256,
      "\"##": 257,
      "ar": 258,
      "et": 259,
      "get": 260,
      "tar": 261,
      "ĠX": 262,
      "\"###": 263,
      "target": 264,
      "do": 265,
      "29": 266,
      "45": 267,
      "91": 268,
      "31": 269,
      "64": 270,
      "11": 271,
      "68": 272,
      "99": 273,
      "54": 274,
      "59": 275,
      "55": 276,
      "25": 277,
      "35": 278,
      "15": 279,
      "23": 280,
      "95": 281,
      "62": 282,
      "67": 283,
      "96": 284,
      "42": 285,
      "83": 286,
      "46": 287,
      "80": 288,
      "38": 289,
      "57": 290,
      "37": 291,
      "28": 292,
      "89": 293,
      "77": 294,
      "12": 295,
      "78": 296,
      "60": 297,
      "48": 298,
      "20": 299,
      "66": 300,
      "44": 301,
      "10": 302,
      "36": 303,
      "75": 304,
      "34": 305,
      "33": 306,
      "92": 307,
      "81": 308,
      "70": 309,
      "13": 310,
      "32": 311,
      "97": 312,
      "39": 313,
      "41": 314,
      "79": 315,
      "94": 316,
      "56": 317,
      "84": 318,
      "63": 319,
      "69": 320,
      "18": 321,
      "14": 322,
      "30": 323,
      "52": 324,
      "93": 325,
      "19": 326,
      "82": 327,
      "49": 328,
      "22": 329,
      "98": 330,
      "85": 331,
      "21": 332,
      "53": 333,
      "87": 334,
      "24": 335,
      "40": 336,
      "47": 337,
      "16": 338,
      "58": 339,
      "51": 340,
      "43": 341,
      "71": 342,
      "72": 343,
      "90": 344,
      "27": 345,
      "17": 346,
      "50": 347,
      "86": 348,
      "74": 349,
      "26": 350,
      "61": 351,
      "88": 352,
      "65": 353,
      "76": 354,
      "73": 355
    },
    "merges": [
      "# #",
      "\" ##",
      "a r",
      "e t",
      "g et",
      "t ar",
      "Ġ X",
      "\"## #",
      "tar get",
      "d o",
      "2 9",
      "4 5",
      "9 1",
      "3 1",
      "6 4",
      "1 1",
      "6 8",
      "9 9",
      "5 4",
      "5 9",
      "5 5",
      "2 5",
      "3 5",
      "1 5",
      "2 3",
      "9 5",
      "6 2",
      "6 7",
      "9 6",
      "4 2",
      "8 3",
      "4 6",
      "8 0",
      "3 8",
      "5 7",
      "3 7",
      "2 8",
      "8 9",
      "7 7",
      "1 2",
      "7 8",
      "6 0",
      "4 8",
      "2 0",
      "6 6",
      "4 4",
      "1 0",
      "3 6",
      "7 5",
      "3 4",
      "3 3",
      "9 2",
      "8 1",
      "7 0",
      "1 3",
      "3 2",
      "9 7",
      "3 9",
      "4 1",
      "7 9",
      "9 4",
      "5 6",
      "8 4",
      "6 3",
      "6 9",
      "1 8",
      "1 4",
      "3 0",
      "5 2",
      "9 3",
      "1 9",
      "8 2",
      "4 9",
      "2 2",
      "9 8",
      "8 5",
      "2 1",
      "5 3",
      "8 7",
      "2 4",
      "4 0",
      "4 7",
      "1 6",
      "5 8",
      "5 1",
      "4 3",
      "7 1",
      "7 2",
      "9 0",
      "2 7",
      "1 7",
      "5 0",
      "8 6",
      "7 4",
      "2 6",
      "6 1",
      "8 8",
      "6 5",
      "7 6",
      "7 3"
    ]
  }
}